# Mutinfo
[English/Английский](./README.md)
Фреймворк для изучения наборов данных и нейросетей методами теории информации.

## Featires
- [x] Оценщик взаимной информации методом ядерной оценки плотности (метод максимального правдоподобия и МНК).
- [x] Оценщик взаимной информации методом Козаченко-Леоненко (оригинальный и взвешенный).
- [x] Фреймворк для оценки взаимной информации посредством сжатия с потерями.
- [x] Генератор синтетических наборов данных с заданными теоретико-информационными характеристиками.
- [X] Эксперименты с информационным бутылочным горлышком в нейросетях.